<?php
echo "Выполнил работу Петров Илья П-23\n";
echo "Введите месяц цифрой от 1 до 12: ";
$mesyac = readline(); 
$dneyvmesyace = [
    1 => 31,
    2 => 28,
    3 => 31,
    4 => 30,
    5 => 31,
    6 => 30,
    7 => 31,
    8 => 31,
    9 => 30,
    10 => 31,
    11 => 30,
    12 => 31
];

$nazvaniemesyaca = [
    1 => "Январь",
    2 => "Февраль",
    3 => "Март",
    4 => "Апрель",
    5 => "Май",
    6 => "Июнь",
    7 => "Июль",
    8 => "Август",
    9 => "Сентябрь",
    10 => "Октябрь",
    11 => "Ноябрь",
    12 => "Декабрь"

];
if (array_key_exists($mesyac, $dneyvmesyace)) {
    echo "\n";
    echo "Год не високосный. \n";
    echo "Название месяца: " . $nazvaniemesyaca[$mesyac]; echo "\n";
    echo "Количество дней в месяце: " . $dneyvmesyace[$mesyac];
    echo "\n";
} else {
    echo "Неверный номер месяца";
}